#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/9248de6c-defa-4320-8ea7-ca4ffafe212c/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # google_project_service.host_cloudresourcemanager will be created
  + resource "google_project_service" "host_cloudresourcemanager" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "aerobic-pivot-478614-k3"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.host_compute will be created
  + resource "google_project_service" "host_compute" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "aerobic-pivot-478614-k3"
      + service            = "compute.googleapis.com"
    }

  # google_project_service.host_iam will be created
  + resource "google_project_service" "host_iam" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "aerobic-pivot-478614-k3"
      + service            = "iam.googleapis.com"
    }

  # google_project_service.service_cloudresourcemanager will be created
  + resource "google_project_service" "service_cloudresourcemanager" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "gke-service-478615"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.service_compute will be created
  + resource "google_project_service" "service_compute" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "gke-service-478615"
      + service            = "compute.googleapis.com"
    }

  # google_project_service.service_container will be created
  + resource "google_project_service" "service_container" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "gke-service-478615"
      + service            = "container.googleapis.com"
    }

  # google_project_service.service_iam will be created
  + resource "google_project_service" "service_iam" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "gke-service-478615"
      + service            = "iam.googleapis.com"
    }

  # module.cloud_router_nat.google_compute_router.router will be created
  + resource "google_compute_router" "router" {
      + creation_timestamp            = (known after apply)
      + encrypted_interconnect_router = false
      + id                            = (known after apply)
      + name                          = "shared-vpc-nat-router"
      + network                       = "shared-vpc-network"
      + project                       = "aerobic-pivot-478614-k3"
      + region                        = "us-central1"
      + self_link                     = (known after apply)

      + bgp {
          + advertise_mode     = "CUSTOM"
          + asn                = 65001
          + identifier_range   = (known after apply)
          + keepalive_interval = 20
        }
    }

  # module.cloud_router_nat.google_compute_router_nat.nats["shared-vpc-nat"] will be created
  + resource "google_compute_router_nat" "nats" {
      + auto_network_tier                   = (known after apply)
      + drain_nat_ips                       = (known after apply)
      + enable_dynamic_port_allocation      = (known after apply)
      + enable_endpoint_independent_mapping = (known after apply)
      + endpoint_types                      = (known after apply)
      + icmp_idle_timeout_sec               = 30
      + id                                  = (known after apply)
      + min_ports_per_vm                    = (known after apply)
      + name                                = "shared-vpc-nat"
      + nat_ip_allocate_option              = "AUTO_ONLY"
      + nat_ips                             = (known after apply)
      + project                             = "aerobic-pivot-478614-k3"
      + region                              = "us-central1"
      + router                              = "shared-vpc-nat-router"
      + source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec    = 1200
      + tcp_time_wait_timeout_sec           = 120
      + tcp_transitory_idle_timeout_sec     = 30
      + type                                = "PUBLIC"
      + udp_idle_timeout_sec                = 30

      + log_config {
          + enable = true
          + filter = "ERRORS_ONLY"
        }
    }

  # module.gke.data.google_compute_zones.available[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_zones" "available" {
      + id      = (known after apply)
      + names   = (known after apply)
      + project = "gke-service-478615"
      + region  = "us-central1"
    }

  # module.gke.data.google_container_engine_versions.region will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "region" {
      + default_cluster_version                = (known after apply)
      + id                                     = (known after apply)
      + latest_master_version                  = (known after apply)
      + latest_node_version                    = (known after apply)
      + location                               = "us-central1"
      + project                                = "gke-service-478615"
      + release_channel_default_version        = (known after apply)
      + release_channel_latest_version         = (known after apply)
      + release_channel_upgrade_target_version = (known after apply)
      + valid_master_versions                  = (known after apply)
      + valid_node_versions                    = (known after apply)
    }

  # module.gke.data.google_container_engine_versions.zone will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_engine_versions" "zone" {
      + default_cluster_version                = (known after apply)
      + id                                     = (known after apply)
      + latest_master_version                  = (known after apply)
      + latest_node_version                    = (known after apply)
      + location                               = (known after apply)
      + project                                = "gke-service-478615"
      + release_channel_default_version        = (known after apply)
      + release_channel_latest_version         = (known after apply)
      + release_channel_upgrade_target_version = (known after apply)
      + valid_master_versions                  = (known after apply)
      + valid_node_versions                    = (known after apply)
    }

  # module.gke.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr                        = (known after apply)
      + datapath_provider                        = (known after apply)
      + default_max_pods_per_node                = 110
      + deletion_protection                      = false
      + disable_l4_lb_firewall_reconciliation    = false
      + effective_labels                         = {
          + "goog-terraform-provisioned" = "true"
        }
      + enable_cilium_clusterwide_network_policy = false
      + enable_fqdn_network_policy               = false
      + enable_intranode_visibility              = false
      + enable_kubernetes_alpha                  = false
      + enable_l4_ilb_subsetting                 = false
      + enable_legacy_abac                       = false
      + enable_multi_networking                  = false
      + enable_shielded_nodes                    = true
      + enable_tpu                               = false
      + endpoint                                 = (known after apply)
      + id                                       = (known after apply)
      + label_fingerprint                        = (known after apply)
      + location                                 = "us-central1"
      + logging_service                          = "logging.googleapis.com/kubernetes"
      + master_version                           = (known after apply)
      + monitoring_service                       = "monitoring.googleapis.com/kubernetes"
      + name                                     = "shared-vpc-gke"
      + network                                  = "projects/aerobic-pivot-478614-k3/global/networks/shared-vpc-network"
      + networking_mode                          = "VPC_NATIVE"
      + node_locations                           = (known after apply)
      + node_version                             = (known after apply)
      + operation                                = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + project                                  = "gke-service-478615"
      + remove_default_node_pool                 = true
      + self_link                                = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = "projects/aerobic-pivot-478614-k3/regions/us-central1/subnetworks/gke-subnet"
      + terraform_labels                         = {
          + "goog-terraform-provisioned" = "true"
        }
      + tpu_ipv4_cidr_block                      = (known after apply)
        # (1 unchanged attribute hidden)

      + addons_config {
          + cloudrun_config (known after apply)
          + config_connector_config {
              + enabled = false
            }
          + dns_cache_config {
              + enabled = false
            }
          + gce_persistent_disk_csi_driver_config {
              + enabled = true
            }
          + gcp_filestore_csi_driver_config {
              + enabled = false
            }
          + gcs_fuse_csi_driver_config (known after apply)
          + gke_backup_agent_config {
              + enabled = false
            }
          + horizontal_pod_autoscaling {
              + disabled = false
            }
          + http_load_balancing {
              + disabled = false
            }
          + istio_config {
              + auth     = "AUTH_MUTUAL_TLS"
              + disabled = true
            }
          + kalm_config {
              + enabled = false
            }
          + lustre_csi_driver_config (known after apply)
          + network_policy_config {
              + disabled = true
            }
          + parallelstore_csi_driver_config (known after apply)
          + ray_operator_config (known after apply)
          + stateful_ha_config (known after apply)
        }

      + anonymous_authentication_config (known after apply)

      + authenticator_groups_config (known after apply)

      + cluster_autoscaling {
          + auto_provisioning_locations = (known after apply)
          + autoscaling_profile         = "BALANCED"
          + enabled                     = false

          + auto_provisioning_defaults (known after apply)
        }

      + cluster_telemetry (known after apply)

      + confidential_nodes (known after apply)

      + control_plane_endpoints_config (known after apply)

      + cost_management_config (known after apply)

      + database_encryption {
          + state    = "DECRYPTED"
            # (1 unchanged attribute hidden)
        }

      + default_snat_status {
          + disabled = false
        }

      + enterprise_config (known after apply)

      + gateway_api_config (known after apply)

      + gke_auto_upgrade_config (known after apply)

      + identity_service_config {
          + enabled = false
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "gke-pods"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "gke-services"
          + stack_type                    = "IPV4"

          + auto_ipam_config (known after apply)

          + network_tier_config (known after apply)

          + pod_cidr_overprovision_config (known after apply)
        }

      + logging_config (known after apply)

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "05:00"
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + master_authorized_networks_config {
          + gcp_public_cidrs_access_enabled      = (known after apply)
          + private_endpoint_enforcement_enabled = (known after apply)

          + cidr_blocks {
              + cidr_block   = "0.0.0.0/0"
              + display_name = "all"
            }
        }

      + mesh_certificates {
          + enable_certificates = false
        }

      + monitoring_config (known after apply)

      + network_policy {
          + enabled = false
        }

      + node_config (known after apply)

      + node_pool {
          + initial_node_count          = 0
          + instance_group_urls         = (known after apply)
          + managed_instance_group_urls = (known after apply)
          + max_pods_per_node           = (known after apply)
          + name                        = "default-pool"
          + name_prefix                 = (known after apply)
          + node_count                  = (known after apply)
          + node_locations              = (known after apply)
          + version                     = (known after apply)

          + management {
              + auto_repair  = true
              + auto_upgrade = true
            }

          + network_config (known after apply)

          + node_config {
              + disk_size_gb                = (known after apply)
              + disk_type                   = (known after apply)
              + effective_taints            = (known after apply)
              + enable_confidential_storage = false
              + image_type                  = "COS_CONTAINERD"
              + labels                      = (known after apply)
              + local_ssd_count             = (known after apply)
              + logging_variant             = "DEFAULT"
              + machine_type                = "e2-small"
              + metadata                    = (known after apply)
              + min_cpu_platform            = (known after apply)
              + oauth_scopes                = (known after apply)
              + preemptible                 = false
              + service_account             = (known after apply)
              + spot                        = false
              + storage_pools               = []
              + tags                        = [
                  + "gke-shared-vpc-gke",
                  + "gke-shared-vpc-gke-default-pool",
                  + "gke-node",
                ]

              + boot_disk (known after apply)

              + confidential_nodes (known after apply)

              + gcfs_config (known after apply)

              + guest_accelerator (known after apply)

              + kubelet_config (known after apply)

              + linux_node_config (known after apply)

              + shielded_instance_config {
                  + enable_integrity_monitoring = true
                  + enable_secure_boot          = false
                }

              + windows_node_config (known after apply)

              + workload_metadata_config {
                  + mode = "GKE_METADATA"
                }
            }

          + upgrade_settings (known after apply)
        }

      + node_pool_auto_config (known after apply)

      + node_pool_defaults {
          + node_config_defaults {
              + insecure_kubelet_readonly_port_enabled = (known after apply)
              + logging_variant                        = (known after apply)

              + gcfs_config {
                  + enabled = false
                }
            }
        }

      + notification_config {
          + pubsub {
              + enabled = false
                # (1 unchanged attribute hidden)
            }
        }

      + pod_autoscaling (known after apply)

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = "172.16.0.0/28"
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)

          + master_global_access_config {
              + enabled = true
            }
        }

      + protect_config {
          + workload_vulnerability_mode = (known after apply)

          + workload_config {
              + audit_mode = "DISABLED"
            }
        }

      + rbac_binding_config (known after apply)

      + release_channel {
          + channel = "REGULAR"
        }

      + security_posture_config {
          + mode               = "DISABLED"
          + vulnerability_mode = "VULNERABILITY_DISABLED"
        }

      + service_external_ips_config (known after apply)

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + tpu_config (known after apply)

      + vertical_pod_autoscaling {
          + enabled = false
        }

      + workload_alts_config (known after apply)

      + workload_identity_config {
          + workload_pool = "gke-service-478615.svc.id.goog"
        }
    }

  # module.gke.google_container_node_pool.pools["primary-nodes"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster                     = "shared-vpc-gke"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "primary-nodes"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "gke-service-478615"
      + version                     = (known after apply)

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + network_config (known after apply)

      + node_config {
          + disk_size_gb                = 100
          + disk_type                   = "pd-standard"
          + effective_taints            = (known after apply)
          + enable_confidential_storage = false
          + image_type                  = "COS_CONTAINERD"
          + labels                      = {
              + "cluster_name" = "shared-vpc-gke"
              + "env"          = "test"
              + "node_pool"    = "primary-nodes"
            }
          + local_ssd_count             = 0
          + logging_variant             = "DEFAULT"
          + machine_type                = "e2-small"
          + metadata                    = {
              + "cluster_name"             = "shared-vpc-gke"
              + "disable-legacy-endpoints" = "true"
              + "node_pool"                = "primary-nodes"
            }
          + min_cpu_platform            = (known after apply)
          + oauth_scopes                = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible                 = false
          + service_account             = (known after apply)
          + spot                        = false
          + storage_pools               = []
          + tags                        = [
              + "gke-shared-vpc-gke",
              + "gke-shared-vpc-gke-primary-nodes",
              + "gke-node",
            ]
            # (1 unchanged attribute hidden)

          + boot_disk (known after apply)

          + confidential_nodes (known after apply)

          + gcfs_config (known after apply)

          + guest_accelerator (known after apply)

          + kubelet_config (known after apply)

          + linux_node_config (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + windows_node_config (known after apply)

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = 1
          + max_unavailable = 0
          + strategy        = "SURGE"

          + blue_green_settings (known after apply)
        }
    }

  # module.gke.google_project_iam_member.cluster_service_account_metric_writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account_metric_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "gke-service-478615"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.gke.google_project_iam_member.cluster_service_account_node_service_account[0] will be created
  + resource "google_project_iam_member" "cluster_service_account_node_service_account" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "gke-service-478615"
      + role    = "roles/container.defaultNodeServiceAccount"
    }

  # module.gke.google_project_iam_member.cluster_service_account_resource_metadata_writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account_resource_metadata_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "gke-service-478615"
      + role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # module.gke.google_service_account.cluster_service_account[0] will be created
  + resource "google_service_account" "cluster_service_account" {
      + account_id   = (known after apply)
      + disabled     = false
      + display_name = "Terraform-managed service account for cluster shared-vpc-gke"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "gke-service-478615"
      + unique_id    = (known after apply)
    }

  # module.gke.random_shuffle.available_zones[0] will be created
  + resource "random_shuffle" "available_zones" {
      + id           = (known after apply)
      + input        = (known after apply)
      + result       = (known after apply)
      + result_count = 3
    }

  # module.gke.random_string.cluster_service_account_suffix[0] will be created
  + resource "random_string" "cluster_service_account_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.shared_vpc_network.module.subnets.google_compute_subnetwork.subnetwork["us-central1/gke-subnet"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.0.0.0/20"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "gke-subnet"
      + network                    = "shared-vpc-network"
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "aerobic-pivot-478614-k3"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)

      + secondary_ip_range {
          + ip_cidr_range = "10.1.0.0/16"
          + range_name    = "gke-pods"
        }
      + secondary_ip_range {
          + ip_cidr_range = "10.2.0.0/20"
          + range_name    = "gke-services"
        }
    }

  # module.shared_vpc_network.module.subnets.google_compute_subnetwork.subnetwork["us-central1/internal-subnet-1"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.3.0.0/20"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "internal-subnet-1"
      + network                    = "shared-vpc-network"
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "aerobic-pivot-478614-k3"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)

      + secondary_ip_range (known after apply)
    }

  # module.shared_vpc_network.module.subnets.google_compute_subnetwork.subnetwork["us-central1/internal-subnet-2"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.4.0.0/20"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "internal-subnet-2"
      + network                    = "shared-vpc-network"
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "aerobic-pivot-478614-k3"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)

      + secondary_ip_range (known after apply)
    }

  # module.shared_vpc_network.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = false
      + bgp_best_path_selection_mode              = "LEGACY"
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + enable_ula_internal_ipv6                  = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = 0
      + name                                      = "shared-vpc-network"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "aerobic-pivot-478614-k3"
      + routing_mode                              = "REGIONAL"
      + self_link                                 = (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 21 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # google_project_service.host_cloudresourcemanager will be created%0A  + resource "google_project_service" "host_cloudresourcemanager" {%0A      + disable_on_destroy = false%0A      + id                 = (known after apply)%0A      + project            = "aerobic-pivot-478614-k3"%0A      + service            = "cloudresourcemanager.googleapis.com"%0A    }%0A%0A  # google_project_service.host_compute will be created%0A  + resource "google_project_service" "host_compute" {%0A      + disable_on_destroy = false%0A      + id                 = (known after apply)%0A      + project            = "aerobic-pivot-478614-k3"%0A      + service            = "compute.googleapis.com"%0A    }%0A%0A  # google_project_service.host_iam will be created%0A  + resource "google_project_service" "host_iam" {%0A      + disable_on_destroy = false%0A      + id                 = (known after apply)%0A      + project            = "aerobic-pivot-478614-k3"%0A      + service            = "iam.googleapis.com"%0A    }%0A%0A  # google_project_service.service_cloudresourcemanager will be created%0A  + resource "google_project_service" "service_cloudresourcemanager" {%0A      + disable_on_destroy = false%0A      + id                 = (known after apply)%0A      + project            = "gke-service-478615"%0A      + service            = "cloudresourcemanager.googleapis.com"%0A    }%0A%0A  # google_project_service.service_compute will be created%0A  + resource "google_project_service" "service_compute" {%0A      + disable_on_destroy = false%0A      + id                 = (known after apply)%0A      + project            = "gke-service-478615"%0A      + service            = "compute.googleapis.com"%0A    }%0A%0A  # google_project_service.service_container will be created%0A  + resource "google_project_service" "service_container" {%0A      + disable_on_destroy = false%0A      + id                 = (known after apply)%0A      + project            = "gke-service-478615"%0A      + service            = "container.googleapis.com"%0A    }%0A%0A  # google_project_service.service_iam will be created%0A  + resource "google_project_service" "service_iam" {%0A      + disable_on_destroy = false%0A      + id                 = (known after apply)%0A      + project            = "gke-service-478615"%0A      + service            = "iam.googleapis.com"%0A    }%0A%0A  # module.cloud_router_nat.google_compute_router.router will be created%0A  + resource "google_compute_router" "router" {%0A      + creation_timestamp            = (known after apply)%0A      + encrypted_interconnect_router = false%0A      + id                            = (known after apply)%0A      + name                          = "shared-vpc-nat-router"%0A      + network                       = "shared-vpc-network"%0A      + project                       = "aerobic-pivot-478614-k3"%0A      + region                        = "us-central1"%0A      + self_link                     = (known after apply)%0A%0A      + bgp {%0A          + advertise_mode     = "CUSTOM"%0A          + asn                = 65001%0A          + identifier_range   = (known after apply)%0A          + keepalive_interval = 20%0A        }%0A    }%0A%0A  # module.cloud_router_nat.google_compute_router_nat.nats["shared-vpc-nat"] will be created%0A  + resource "google_compute_router_nat" "nats" {%0A      + auto_network_tier                   = (known after apply)%0A      + drain_nat_ips                       = (known after apply)%0A      + enable_dynamic_port_allocation      = (known after apply)%0A      + enable_endpoint_independent_mapping = (known after apply)%0A      + endpoint_types                      = (known after apply)%0A      + icmp_idle_timeout_sec               = 30%0A      + id                                  = (known after apply)%0A      + min_ports_per_vm                    = (known after apply)%0A      + name                                = "shared-vpc-nat"%0A      + nat_ip_allocate_option              = "AUTO_ONLY"%0A      + nat_ips                             = (known after apply)%0A      + project                             = "aerobic-pivot-478614-k3"%0A      + region                              = "us-central1"%0A      + router                              = "shared-vpc-nat-router"%0A      + source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES"%0A      + tcp_established_idle_timeout_sec    = 1200%0A      + tcp_time_wait_timeout_sec           = 120%0A      + tcp_transitory_idle_timeout_sec     = 30%0A      + type                                = "PUBLIC"%0A      + udp_idle_timeout_sec                = 30%0A%0A      + log_config {%0A          + enable = true%0A          + filter = "ERRORS_ONLY"%0A        }%0A    }%0A%0A  # module.gke.data.google_compute_zones.available[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_compute_zones" "available" {%0A      + id      = (known after apply)%0A      + names   = (known after apply)%0A      + project = "gke-service-478615"%0A      + region  = "us-central1"%0A    }%0A%0A  # module.gke.data.google_container_engine_versions.region will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_container_engine_versions" "region" {%0A      + default_cluster_version                = (known after apply)%0A      + id                                     = (known after apply)%0A      + latest_master_version                  = (known after apply)%0A      + latest_node_version                    = (known after apply)%0A      + location                               = "us-central1"%0A      + project                                = "gke-service-478615"%0A      + release_channel_default_version        = (known after apply)%0A      + release_channel_latest_version         = (known after apply)%0A      + release_channel_upgrade_target_version = (known after apply)%0A      + valid_master_versions                  = (known after apply)%0A      + valid_node_versions                    = (known after apply)%0A    }%0A%0A  # module.gke.data.google_container_engine_versions.zone will be read during apply%0A  # (config refers to values not yet known)%0A <= data "google_container_engine_versions" "zone" {%0A      + default_cluster_version                = (known after apply)%0A      + id                                     = (known after apply)%0A      + latest_master_version                  = (known after apply)%0A      + latest_node_version                    = (known after apply)%0A      + location                               = (known after apply)%0A      + project                                = "gke-service-478615"%0A      + release_channel_default_version        = (known after apply)%0A      + release_channel_latest_version         = (known after apply)%0A      + release_channel_upgrade_target_version = (known after apply)%0A      + valid_master_versions                  = (known after apply)%0A      + valid_node_versions                    = (known after apply)%0A    }%0A%0A  # module.gke.google_container_cluster.primary will be created%0A  + resource "google_container_cluster" "primary" {%0A      + cluster_ipv4_cidr                        = (known after apply)%0A      + datapath_provider                        = (known after apply)%0A      + default_max_pods_per_node                = 110%0A      + deletion_protection                      = false%0A      + disable_l4_lb_firewall_reconciliation    = false%0A      + effective_labels                         = {%0A          + "goog-terraform-provisioned" = "true"%0A        }%0A      + enable_cilium_clusterwide_network_policy = false%0A      + enable_fqdn_network_policy               = false%0A      + enable_intranode_visibility              = false%0A      + enable_kubernetes_alpha                  = false%0A      + enable_l4_ilb_subsetting                 = false%0A      + enable_legacy_abac                       = false%0A      + enable_multi_networking                  = false%0A      + enable_shielded_nodes                    = true%0A      + enable_tpu                               = false%0A      + endpoint                                 = (known after apply)%0A      + id                                       = (known after apply)%0A      + label_fingerprint                        = (known after apply)%0A      + location                                 = "us-central1"%0A      + logging_service                          = "logging.googleapis.com/kubernetes"%0A      + master_version                           = (known after apply)%0A      + monitoring_service                       = "monitoring.googleapis.com/kubernetes"%0A      + name                                     = "shared-vpc-gke"%0A      + network                                  = "projects/aerobic-pivot-478614-k3/global/networks/shared-vpc-network"%0A      + networking_mode                          = "VPC_NATIVE"%0A      + node_locations                           = (known after apply)%0A      + node_version                             = (known after apply)%0A      + operation                                = (known after apply)%0A      + private_ipv6_google_access               = (known after apply)%0A      + project                                  = "gke-service-478615"%0A      + remove_default_node_pool                 = true%0A      + self_link                                = (known after apply)%0A      + services_ipv4_cidr                       = (known after apply)%0A      + subnetwork                               = "projects/aerobic-pivot-478614-k3/regions/us-central1/subnetworks/gke-subnet"%0A      + terraform_labels                         = {%0A          + "goog-terraform-provisioned" = "true"%0A        }%0A      + tpu_ipv4_cidr_block                      = (known after apply)%0A        # (1 unchanged attribute hidden)%0A%0A      + addons_config {%0A          + cloudrun_config (known after apply)%0A          + config_connector_config {%0A              + enabled = false%0A            }%0A          + dns_cache_config {%0A              + enabled = false%0A            }%0A          + gce_persistent_disk_csi_driver_config {%0A              + enabled = true%0A            }%0A          + gcp_filestore_csi_driver_config {%0A              + enabled = false%0A            }%0A          + gcs_fuse_csi_driver_config (known after apply)%0A          + gke_backup_agent_config {%0A              + enabled = false%0A            }%0A          + horizontal_pod_autoscaling {%0A              + disabled = false%0A            }%0A          + http_load_balancing {%0A              + disabled = false%0A            }%0A          + istio_config {%0A              + auth     = "AUTH_MUTUAL_TLS"%0A              + disabled = true%0A            }%0A          + kalm_config {%0A              + enabled = false%0A            }%0A          + lustre_csi_driver_config (known after apply)%0A          + network_policy_config {%0A              + disabled = true%0A            }%0A          + parallelstore_csi_driver_config (known after apply)%0A          + ray_operator_config (known after apply)%0A          + stateful_ha_config (known after apply)%0A        }%0A%0A      + anonymous_authentication_config (known after apply)%0A%0A      + authenticator_groups_config (known after apply)%0A%0A      + cluster_autoscaling {%0A          + auto_provisioning_locations = (known after apply)%0A          + autoscaling_profile         = "BALANCED"%0A          + enabled                     = false%0A%0A          + auto_provisioning_defaults (known after apply)%0A        }%0A%0A      + cluster_telemetry (known after apply)%0A%0A      + confidential_nodes (known after apply)%0A%0A      + control_plane_endpoints_config (known after apply)%0A%0A      + cost_management_config (known after apply)%0A%0A      + database_encryption {%0A          + state    = "DECRYPTED"%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      + default_snat_status {%0A          + disabled = false%0A        }%0A%0A      + enterprise_config (known after apply)%0A%0A      + gateway_api_config (known after apply)%0A%0A      + gke_auto_upgrade_config (known after apply)%0A%0A      + identity_service_config {%0A          + enabled = false%0A        }%0A%0A      + ip_allocation_policy {%0A          + cluster_ipv4_cidr_block       = (known after apply)%0A          + cluster_secondary_range_name  = "gke-pods"%0A          + services_ipv4_cidr_block      = (known after apply)%0A          + services_secondary_range_name = "gke-services"%0A          + stack_type                    = "IPV4"%0A%0A          + auto_ipam_config (known after apply)%0A%0A          + network_tier_config (known after apply)%0A%0A          + pod_cidr_overprovision_config (known after apply)%0A        }%0A%0A      + logging_config (known after apply)%0A%0A      + maintenance_policy {%0A          + daily_maintenance_window {%0A              + duration   = (known after apply)%0A              + start_time = "05:00"%0A            }%0A        }%0A%0A      + master_auth {%0A          + client_certificate     = (known after apply)%0A          + client_key             = (sensitive value)%0A          + cluster_ca_certificate = (known after apply)%0A%0A          + client_certificate_config {%0A              + issue_client_certificate = false%0A            }%0A        }%0A%0A      + master_authorized_networks_config {%0A          + gcp_public_cidrs_access_enabled      = (known after apply)%0A          + private_endpoint_enforcement_enabled = (known after apply)%0A%0A          + cidr_blocks {%0A              + cidr_block   = "0.0.0.0/0"%0A              + display_name = "all"%0A            }%0A        }%0A%0A      + mesh_certificates {%0A          + enable_certificates = false%0A        }%0A%0A      + monitoring_config (known after apply)%0A%0A      + network_policy {%0A          + enabled = false%0A        }%0A%0A      + node_config (known after apply)%0A%0A      + node_pool {%0A          + initial_node_count          = 0%0A          + instance_group_urls         = (known after apply)%0A          + managed_instance_group_urls = (known after apply)%0A          + max_pods_per_node           = (known after apply)%0A          + name                        = "default-pool"%0A          + name_prefix                 = (known after apply)%0A          + node_count                  = (known after apply)%0A          + node_locations              = (known after apply)%0A          + version                     = (known after apply)%0A%0A          + management {%0A              + auto_repair  = true%0A              + auto_upgrade = true%0A            }%0A%0A          + network_config (known after apply)%0A%0A          + node_config {%0A              + disk_size_gb                = (known after apply)%0A              + disk_type                   = (known after apply)%0A              + effective_taints            = (known after apply)%0A              + enable_confidential_storage = false%0A              + image_type                  = "COS_CONTAINERD"%0A              + labels                      = (known after apply)%0A              + local_ssd_count             = (known after apply)%0A              + logging_variant             = "DEFAULT"%0A              + machine_type                = "e2-small"%0A              + metadata                    = (known after apply)%0A              + min_cpu_platform            = (known after apply)%0A              + oauth_scopes                = (known after apply)%0A              + preemptible                 = false%0A              + service_account             = (known after apply)%0A              + spot                        = false%0A              + storage_pools               = []%0A              + tags                        = [%0A                  + "gke-shared-vpc-gke",%0A                  + "gke-shared-vpc-gke-default-pool",%0A                  + "gke-node",%0A                ]%0A%0A              + boot_disk (known after apply)%0A%0A              + confidential_nodes (known after apply)%0A%0A              + gcfs_config (known after apply)%0A%0A              + guest_accelerator (known after apply)%0A%0A              + kubelet_config (known after apply)%0A%0A              + linux_node_config (known after apply)%0A%0A              + shielded_instance_config {%0A                  + enable_integrity_monitoring = true%0A                  + enable_secure_boot          = false%0A                }%0A%0A              + windows_node_config (known after apply)%0A%0A              + workload_metadata_config {%0A                  + mode = "GKE_METADATA"%0A                }%0A            }%0A%0A          + upgrade_settings (known after apply)%0A        }%0A%0A      + node_pool_auto_config (known after apply)%0A%0A      + node_pool_defaults {%0A          + node_config_defaults {%0A              + insecure_kubelet_readonly_port_enabled = (known after apply)%0A              + logging_variant                        = (known after apply)%0A%0A              + gcfs_config {%0A                  + enabled = false%0A                }%0A            }%0A        }%0A%0A      + notification_config {%0A          + pubsub {%0A              + enabled = false%0A                # (1 unchanged attribute hidden)%0A            }%0A        }%0A%0A      + pod_autoscaling (known after apply)%0A%0A      + private_cluster_config {%0A          + enable_private_nodes   = true%0A          + master_ipv4_cidr_block = "172.16.0.0/28"%0A          + peering_name           = (known after apply)%0A          + private_endpoint       = (known after apply)%0A          + public_endpoint        = (known after apply)%0A%0A          + master_global_access_config {%0A              + enabled = true%0A            }%0A        }%0A%0A      + protect_config {%0A          + workload_vulnerability_mode = (known after apply)%0A%0A          + workload_config {%0A              + audit_mode = "DISABLED"%0A            }%0A        }%0A%0A      + rbac_binding_config (known after apply)%0A%0A      + release_channel {%0A          + channel = "REGULAR"%0A        }%0A%0A      + security_posture_config {%0A          + mode               = "DISABLED"%0A          + vulnerability_mode = "VULNERABILITY_DISABLED"%0A        }%0A%0A      + service_external_ips_config (known after apply)%0A%0A      + timeouts {%0A          + create = "45m"%0A          + delete = "45m"%0A          + update = "45m"%0A        }%0A%0A      + tpu_config (known after apply)%0A%0A      + vertical_pod_autoscaling {%0A          + enabled = false%0A        }%0A%0A      + workload_alts_config (known after apply)%0A%0A      + workload_identity_config {%0A          + workload_pool = "gke-service-478615.svc.id.goog"%0A        }%0A    }%0A%0A  # module.gke.google_container_node_pool.pools["primary-nodes"] will be created%0A  + resource "google_container_node_pool" "pools" {%0A      + cluster                     = "shared-vpc-gke"%0A      + id                          = (known after apply)%0A      + initial_node_count          = (known after apply)%0A      + instance_group_urls         = (known after apply)%0A      + location                    = "us-central1"%0A      + managed_instance_group_urls = (known after apply)%0A      + max_pods_per_node           = (known after apply)%0A      + name                        = "primary-nodes"%0A      + name_prefix                 = (known after apply)%0A      + node_count                  = 1%0A      + node_locations              = (known after apply)%0A      + operation                   = (known after apply)%0A      + project                     = "gke-service-478615"%0A      + version                     = (known after apply)%0A%0A      + management {%0A          + auto_repair  = true%0A          + auto_upgrade = true%0A        }%0A%0A      + network_config (known after apply)%0A%0A      + node_config {%0A          + disk_size_gb                = 100%0A          + disk_type                   = "pd-standard"%0A          + effective_taints            = (known after apply)%0A          + enable_confidential_storage = false%0A          + image_type                  = "COS_CONTAINERD"%0A          + labels                      = {%0A              + "cluster_name" = "shared-vpc-gke"%0A              + "env"          = "test"%0A              + "node_pool"    = "primary-nodes"%0A            }%0A          + local_ssd_count             = 0%0A          + logging_variant             = "DEFAULT"%0A          + machine_type                = "e2-small"%0A          + metadata                    = {%0A              + "cluster_name"             = "shared-vpc-gke"%0A              + "disable-legacy-endpoints" = "true"%0A              + "node_pool"                = "primary-nodes"%0A            }%0A          + min_cpu_platform            = (known after apply)%0A          + oauth_scopes                = [%0A              + "https://www.googleapis.com/auth/cloud-platform",%0A            ]%0A          + preemptible                 = false%0A          + service_account             = (known after apply)%0A          + spot                        = false%0A          + storage_pools               = []%0A          + tags                        = [%0A              + "gke-shared-vpc-gke",%0A              + "gke-shared-vpc-gke-primary-nodes",%0A              + "gke-node",%0A            ]%0A            # (1 unchanged attribute hidden)%0A%0A          + boot_disk (known after apply)%0A%0A          + confidential_nodes (known after apply)%0A%0A          + gcfs_config (known after apply)%0A%0A          + guest_accelerator (known after apply)%0A%0A          + kubelet_config (known after apply)%0A%0A          + linux_node_config (known after apply)%0A%0A          + shielded_instance_config {%0A              + enable_integrity_monitoring = true%0A              + enable_secure_boot          = false%0A            }%0A%0A          + windows_node_config (known after apply)%0A%0A          + workload_metadata_config {%0A              + mode = "GKE_METADATA"%0A            }%0A        }%0A%0A      + timeouts {%0A          + create = "45m"%0A          + delete = "45m"%0A          + update = "45m"%0A        }%0A%0A      + upgrade_settings {%0A          + max_surge       = 1%0A          + max_unavailable = 0%0A          + strategy        = "SURGE"%0A%0A          + blue_green_settings (known after apply)%0A        }%0A    }%0A%0A  # module.gke.google_project_iam_member.cluster_service_account_metric_writer[0] will be created%0A  + resource "google_project_iam_member" "cluster_service_account_metric_writer" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = (known after apply)%0A      + project = "gke-service-478615"%0A      + role    = "roles/monitoring.metricWriter"%0A    }%0A%0A  # module.gke.google_project_iam_member.cluster_service_account_node_service_account[0] will be created%0A  + resource "google_project_iam_member" "cluster_service_account_node_service_account" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = (known after apply)%0A      + project = "gke-service-478615"%0A      + role    = "roles/container.defaultNodeServiceAccount"%0A    }%0A%0A  # module.gke.google_project_iam_member.cluster_service_account_resource_metadata_writer[0] will be created%0A  + resource "google_project_iam_member" "cluster_service_account_resource_metadata_writer" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = (known after apply)%0A      + project = "gke-service-478615"%0A      + role    = "roles/stackdriver.resourceMetadata.writer"%0A    }%0A%0A  # module.gke.google_service_account.cluster_service_account[0] will be created%0A  + resource "google_service_account" "cluster_service_account" {%0A      + account_id   = (known after apply)%0A      + disabled     = false%0A      + display_name = "Terraform-managed service account for cluster shared-vpc-gke"%0A      + email        = (known after apply)%0A      + id           = (known after apply)%0A      + member       = (known after apply)%0A      + name         = (known after apply)%0A      + project      = "gke-service-478615"%0A      + unique_id    = (known after apply)%0A    }%0A%0A  # module.gke.random_shuffle.available_zones[0] will be created%0A  + resource "random_shuffle" "available_zones" {%0A      + id           = (known after apply)%0A      + input        = (known after apply)%0A      + result       = (known after apply)%0A      + result_count = 3%0A    }%0A%0A  # module.gke.random_string.cluster_service_account_suffix[0] will be created%0A  + resource "random_string" "cluster_service_account_suffix" {%0A      + id          = (known after apply)%0A      + length      = 4%0A      + lower       = true%0A      + min_lower   = 0%0A      + min_numeric = 0%0A      + min_special = 0%0A      + min_upper   = 0%0A      + number      = true%0A      + numeric     = true%0A      + result      = (known after apply)%0A      + special     = false%0A      + upper       = false%0A    }%0A%0A  # module.shared_vpc_network.module.subnets.google_compute_subnetwork.subnetwork["us-central1/gke-subnet"] will be created%0A  + resource "google_compute_subnetwork" "subnetwork" {%0A      + creation_timestamp         = (known after apply)%0A      + external_ipv6_prefix       = (known after apply)%0A      + fingerprint                = (known after apply)%0A      + gateway_address            = (known after apply)%0A      + id                         = (known after apply)%0A      + internal_ipv6_prefix       = (known after apply)%0A      + ip_cidr_range              = "10.0.0.0/20"%0A      + ipv6_cidr_range            = (known after apply)%0A      + ipv6_gce_endpoint          = (known after apply)%0A      + name                       = "gke-subnet"%0A      + network                    = "shared-vpc-network"%0A      + private_ip_google_access   = true%0A      + private_ipv6_google_access = (known after apply)%0A      + project                    = "aerobic-pivot-478614-k3"%0A      + purpose                    = (known after apply)%0A      + region                     = "us-central1"%0A      + self_link                  = (known after apply)%0A      + stack_type                 = (known after apply)%0A      + state                      = (known after apply)%0A      + subnetwork_id              = (known after apply)%0A%0A      + secondary_ip_range {%0A          + ip_cidr_range = "10.1.0.0/16"%0A          + range_name    = "gke-pods"%0A        }%0A      + secondary_ip_range {%0A          + ip_cidr_range = "10.2.0.0/20"%0A          + range_name    = "gke-services"%0A        }%0A    }%0A%0A  # module.shared_vpc_network.module.subnets.google_compute_subnetwork.subnetwork["us-central1/internal-subnet-1"] will be created%0A  + resource "google_compute_subnetwork" "subnetwork" {%0A      + creation_timestamp         = (known after apply)%0A      + external_ipv6_prefix       = (known after apply)%0A      + fingerprint                = (known after apply)%0A      + gateway_address            = (known after apply)%0A      + id                         = (known after apply)%0A      + internal_ipv6_prefix       = (known after apply)%0A      + ip_cidr_range              = "10.3.0.0/20"%0A      + ipv6_cidr_range            = (known after apply)%0A      + ipv6_gce_endpoint          = (known after apply)%0A      + name                       = "internal-subnet-1"%0A      + network                    = "shared-vpc-network"%0A      + private_ip_google_access   = true%0A      + private_ipv6_google_access = (known after apply)%0A      + project                    = "aerobic-pivot-478614-k3"%0A      + purpose                    = (known after apply)%0A      + region                     = "us-central1"%0A      + self_link                  = (known after apply)%0A      + stack_type                 = (known after apply)%0A      + state                      = (known after apply)%0A      + subnetwork_id              = (known after apply)%0A%0A      + secondary_ip_range (known after apply)%0A    }%0A%0A  # module.shared_vpc_network.module.subnets.google_compute_subnetwork.subnetwork["us-central1/internal-subnet-2"] will be created%0A  + resource "google_compute_subnetwork" "subnetwork" {%0A      + creation_timestamp         = (known after apply)%0A      + external_ipv6_prefix       = (known after apply)%0A      + fingerprint                = (known after apply)%0A      + gateway_address            = (known after apply)%0A      + id                         = (known after apply)%0A      + internal_ipv6_prefix       = (known after apply)%0A      + ip_cidr_range              = "10.4.0.0/20"%0A      + ipv6_cidr_range            = (known after apply)%0A      + ipv6_gce_endpoint          = (known after apply)%0A      + name                       = "internal-subnet-2"%0A      + network                    = "shared-vpc-network"%0A      + private_ip_google_access   = true%0A      + private_ipv6_google_access = (known after apply)%0A      + project                    = "aerobic-pivot-478614-k3"%0A      + purpose                    = (known after apply)%0A      + region                     = "us-central1"%0A      + self_link                  = (known after apply)%0A      + stack_type                 = (known after apply)%0A      + state                      = (known after apply)%0A      + subnetwork_id              = (known after apply)%0A%0A      + secondary_ip_range (known after apply)%0A    }%0A%0A  # module.shared_vpc_network.module.vpc.google_compute_network.network will be created%0A  + resource "google_compute_network" "network" {%0A      + auto_create_subnetworks                   = false%0A      + bgp_always_compare_med                    = false%0A      + bgp_best_path_selection_mode              = "LEGACY"%0A      + bgp_inter_region_cost                     = (known after apply)%0A      + delete_default_routes_on_create           = false%0A      + enable_ula_internal_ipv6                  = false%0A      + gateway_ipv4                              = (known after apply)%0A      + id                                        = (known after apply)%0A      + internal_ipv6_range                       = (known after apply)%0A      + mtu                                       = 0%0A      + name                                      = "shared-vpc-network"%0A      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"%0A      + network_id                                = (known after apply)%0A      + numeric_id                                = (known after apply)%0A      + project                                   = "aerobic-pivot-478614-k3"%0A      + routing_mode                              = "REGIONAL"%0A      + self_link                                 = (known after apply)%0A        # (1 unchanged attribute hidden)%0A    }%0A%0APlan: 21 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @jagc108, Workflow: `Terraform plan - Test`*